In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("./data/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [125]:
# 7. Выведите статистику возраста для каждой расы (признак race) и каждого пола. Используйте groupby и describe. 
# Найдите таким образом максимальный возраст мужчин расы Asian-Pac-Islander.
# data.groupby(['race', 'sex']).agg({'sex': 'count'})
# data[data.race == 'Asian-Pac-Islander']['age'].max()
data.groupby(['race', 'sex'])['age'].describe()

                             count       mean        std   min   25%   50%  \
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

In [22]:
data['sex'].apply(lambda x: x.upper()) # data.sex.apply()

0          MALE
1          MALE
2          MALE
3          MALE
4        FEMALE
          ...
32556    FEMALE
32557      MALE
32558    FEMALE
32559      MALE
32560    FEMALE
Name: sex, Length: 32561, dtype: object

In [26]:
print(data.salary.unique(), data.salary.nunique())

['<=50K' '>50K'] 2

In [34]:
data[['sex', 'salary']]

          sex salary
0        Male  <=50K
1        Male  <=50K
2        Male  <=50K
3        Male  <=50K
4      Female  <=50K
...       ...    ...
32556  Female  <=50K
32557    Male   >50K
32558  Female  <=50K
32559    Male  <=50K
32560  Female   >50K

[32561 rows x 2 columns]

In [40]:
data.iloc[2]
data.iloc[2:5, 0:2]

   age workclass
2   38   Private
3   53   Private
4   28   Private

In [43]:
data.loc[2]

age                              38
workclass                   Private
fnlwgt                       215646
education                   HS-grad
education-num                     9
marital-status             Divorced
occupation        Handlers-cleaners
relationship          Not-in-family
race                          White
sex                            Male
capital-gain                      0
capital-loss                      0
hours-per-week                   40
native-country        United-States
salary                        <=50K
Name: 2, dtype: object

In [69]:
d1 = [[1,2,3], [4,5,6], [7,80,9]]
df1 = pd.DataFrame(d1)
df1

   0   1  2
0  1   2  3
1  4   5  6
2  7  80  9

In [70]:
df1 = pd.DataFrame(d1, index = ['a', 'b', 'c'], columns = ['X', 'Y', 'Z'])
df1

   X   Y  Z
a  1   2  3
b  4   5  6
c  7  80  9

In [65]:
df1.X # df1['X']

a    1
b    4
c    7
Name: X, dtype: int64

In [71]:
df1.Y.median()

5.0

In [72]:
df1.Y.mean()

29.0

In [54]:
d2 = {'City': ['London', 'Moscow', 'Minsk'],
     'Population': [15, 20, 2],
     'IsBig': [True, True, False]}
df2 = pd.DataFrame(d2)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        3 non-null      object
 1   Population  3 non-null      int64
 2   IsBig       3 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 179.0+ bytes

In [73]:
print(df2.shape)
print(df2.size)
print(df2.dtypes)
print(df2.columns)
print(df2.count())

(3, 3)
9
City          object
Population     int64
IsBig           bool
dtype: object
Index(['City', 'Population', 'IsBig'], dtype='object')
City          3
Population    3
IsBig         3
dtype: int64

In [62]:
df2.value_counts()

City    Population  IsBig
London  15          True     1
Minsk   2           False    1
Moscow  20          True     1
dtype: int64

In [63]:
df2.IsBig.value_counts()

True     2
False    1
Name: IsBig, dtype: int64

In [75]:
df2.describe()

       Population
count    3.000000
mean    12.333333
std      9.291573
min      2.000000
25%      8.500000
50%     15.000000
75%     17.500000
max     20.000000